QuantumLeaps/modern-embedded-programming-course/lesson-19/ek-tm4c123gxl/TM4C123.h
/**************************************************************************//**
 * @file     TM4C123.h
 * @brief    CMSIS Device System Header File for
 *           Texas Instruments Tiva TM4C123 Device Series
 * @version  V12591
 * @date     12. February 2014
 *
 * @note
 *                                                             modified by Keil
 ******************************************************************************/

#ifndef TM4C123_H
#define TM4C123_H

#if   defined(TM4C1230C3PM)
  #include "TM4C1230C3PM.h"
#elif defined(TM4C1230D5PM)
  #include "TM4C1230D5PM.h"
#elif defined(TM4C1230E6PM)
  #include "TM4C1230E6PM.h"
#elif defined(TM4C1230H6PM)
  #include "TM4C1230H6PM.h"
#elif defined(TM4C1231C3PM)
  #include "TM4C1231C3PM.h"
#elif defined(TM4C1231D5PM)
  #include "TM4C1231D5PM.h"
#elif defined(TM4C1231D5PZ)
  #include "TM4C1231D5PZ.h"
#elif defined(TM4C1231E6PM)
  #include "TM4C1231E6PM.h"
#elif defined(TM4C1231E6PZ)
  #include "TM4C1231E6PZ.h"
#elif defined(TM4C1231H6PM)
  #include "TM4C1231H6PM.h"
#elif defined(TM4C1231H6PZ)
  #include "TM4C1231H6PZ.h"
#elif defined(TM4C1232C3PM)
  #include "TM4C1232C3PM.h"
#elif defined(TM4C1232D5PM)
  #include "TM4C1232D5PM.h"
#elif defined(TM4C1232E6PM)
  #include "TM4C1232E6PM.h"
#elif defined(TM4C1232H6PM)
  #include "TM4C1232H6PM.h"
#elif defined(TM4C1233C3PM)
  #include "TM4C1233C3PM.h"
#elif defined(TM4C1233D5PM)
  #include "TM4C1233D5PM.h"
#elif defined(TM4C1233D5PZ)
  #include "TM4C1233D5PZ.h"
#elif defined(TM4C1233E6PM)
  #include "TM4C1233E6PM.h"
#elif defined(TM4C1233E6PZ)
  #include "TM4C1233E6PZ.h"
#elif defined(TM4C1233H6PM)
  #include "TM4C1233H6PM.h"
#elif defined(TM4C1233H6PZ)
  #include "TM4C1233H6PZ.h"
#elif defined(TM4C1236D5PM)
  #include "TM4C1236D5PM.h"
#elif defined(TM4C1236E6PM)
  #include "TM4C1236E6PM.h"
#elif defined(TM4C1236H6PM)
  #include "TM4C1236H6PM.h"
#elif defined(TM4C1237D5PM)
  #include "TM4C1237D5PM.h"
#elif defined(TM4C1237D5PZ)
  #include "TM4C1237D5PZ.h"
#elif defined(TM4C1237E6PM)
  #include "TM4C1237E6PM.h"
#elif defined(TM4C1237E6PZ)
  #include "TM4C1237E6PZ.h"
#elif defined(TM4C1237H6PM)
  #include "TM4C1237H6PM.h"
#elif defined(TM4C1237H6PZ)
  #include "TM4C1237H6PZ.h"
#elif defined(TM4C123AE6PM)
  #include "TM4C123AE6PM.h"
#elif defined(TM4C123AH6PM)
  #include "TM4C123AH6PM.h"
#elif defined(TM4C123BE6PM)
  #include "TM4C123BE6PM.h"
#elif defined(TM4C123BE6PZ)
  #include "TM4C123BE6PZ.h"
#elif defined(TM4C123BH6PM)
  #include "TM4C123BH6PM.h"
#elif defined(TM4C123BH6PZ)
  #include "TM4C123BH6PZ.h"
#elif defined(TM4C123FE6PM)
  #include "TM4C123FE6PM.h"
#elif defined(TM4C123FH6PM)
  #include "TM4C123FH6PM.h"
#elif defined(TM4C123GE6PM)
  #include "TM4C123GE6PM.h"
#elif defined(TM4C123GE6PZ)
  #include "TM4C123GE6PZ.h"
#elif defined(TM4C123GH6PM)
  #include "TM4C123GH6PM.h"
#elif defined(TM4C123GH6PZ)
  #include "TM4C123GH6PZ.h"
#elif defined(TM4C1231H6PGE)
  #include "TM4C1231H6PGE.h"
#elif defined(TM4C1233H6PGE)
  #include "TM4C1233H6PGE.h"
#elif defined(TM4C1237H6PGE)
  #include "TM4C1237H6PGE.h"
#elif defined(TM4C123BH6PGE)
  #include "TM4C123BH6PGE.h"
#elif defined(TM4C123BH6ZRB)
  #include "TM4C123BH6ZRB.h"
#elif defined(TM4C123GH6PGE)
  #include "TM4C123GH6PGE.h"
#elif defined(TM4C123GH6ZRB)
  #include "TM4C123GH6ZRB.h"
#elif defined(TM4C123GH6ZXR)
  #include "TM4C123GH6ZXR.h"
#else
#error "TM4C123.h: TM4C123 Device NOT specified"
#endif

#endif /* TM4C123_H */
